superrrr/app/controllers/projects_controller.rb

  def list
  	@user = User.find_by_subdomain_name(request.subdomain)
---
SELECT `users`.* FROM `users` WHERE `users`.`subdomain_name` = '' LIMIT 1

  def portfolio
  	@user = User.first
  	@projects = Project.order("projects.created_at ASC").visible
---
SELECT `users`.* FROM `users` LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`visible` = 1 ORDER BY projects.created_at ASC

  def show
  	#@user = User.find(session[:user_id])
    @project = Project.find(params[:id])
    @image = Image.new(:project_id => @project.id)
    @project_images = @project.images.order("images.position ASC")
    @project_videos = @project.videos.order("videos.created_at DESC")
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT `images`.* FROM `images` WHERE `images`.`project_id` = 1 ORDER BY images.position ASC
SELECT `videos`.* FROM `videos` WHERE `videos`.`project_id` = 1 ORDER BY videos.created_at DESC

  def create
    @project = Project.new(params[:project])
    if @project.save
---
INSERT INTO `projects` (`client`, `created_at`, `custom_image_thumbnail`, `description`, `layout`, `project_category`, `project_type`, `project_url`, `title`, `updated_at`, `user_id`, `visible`) VALUES (NULL, '2012-01-18 21:24:54', NULL, 'Something that describe this', 1, NULL, 'Images', NULL, 'Sample Images from A client app', '2012-01-18 21:24:54', 1, 1)

  def update
    @project = Project.find(params[:id])
    if @project.update_attributes(params[:project])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
UPDATE `projects` SET `project_url` = 'http://gheehappy.com/', `updated_at` = '2012-01-18 21:28:46' WHERE `projects`.`id` = 1

  def sublist
  	@user = User.first
  	#@user = User.find_by_subdomain_name(request.subdomain)
  	@projects = @user.projects.order("projects.created_at ASC").visible

  	if @projects.blank?
  	  redirect_to( '/404.html')
  	else
      @project = @projects.find(params[:id])
      @project_images = @project.images.order("images.position ASC")
---
SELECT `users`.* FROM `users` LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`user_id` = 1 AND `projects`.`visible` = 1 AND `projects`.`id` = 1 ORDER BY projects.created_at ASC LIMIT 1
SELECT `images`.* FROM `images` WHERE `images`.`project_id` = 1 ORDER BY images.position ASC

  def subabout
  	@user = User.first
---
SELECT `users`.* FROM `users` LIMIT 1

  def find_user
    if session[:user_id]
       @user = User.find(session[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1