superrrr/app/views/access/profile.html.erb

SELECT COUNT(*) FROM `images` INNER JOIN `projects` ON `images`.`project_id` = `projects`.`id` WHERE `projects`.`user_id` = 1
SELECT COUNT(*) FROM `projects` WHERE `projects`.`user_id` = 1
SELECT `images`.* FROM `images` WHERE `images`.`project_id` = 1 ORDER BY `images`.`id` DESC LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`user_id` = 1 ORDER BY projects.created_at ASC
---
<%= link_to("Add New Project", {:controller => 'projects', :action => 'new'}, :class => 'action new') %>
<span style="font-size: 12px;">You have <%= pluralize(@projects.size, 'project') %> (<%= User.max_proj(@user.project_capacity.to_i, @user.fb_like) %>), and <%= pluralize(@images.size, 'image') %> (<%= User.max_img(@user.image_capacity.to_i, @user.fb_like) %>)</span>